<!DOCTYPE html><html><head><title>&#xC815;&#xC801; &#xC0AC;&#xC774;&#xD2B8; &#xC0DD;&#xC131;&#xAE30; - Metalsmith - &#xC6F9; &#xC77D;&#xACE0; &#xC4F0;&#xACE0;</title><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1"><meta name="msvalidate.01" content="20E9379AD2F60C867A2E376C373DD815"><meta name="naver-site-verification" content="a8a8aaf072a0436c79f3d6cdacb82112b253e81f"><meta property="og:type" content="website"><meta property="og:title" content="&#xC6F9; &#xC77D;&#xACE0; &#xC4F0;&#xACE0;"><meta property="og:description" content="&#xC6F9; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC77D;&#xACE0; &#xC4F0;&#xACE0; &#xBCF4;&#xAE30; &#xC88B;&#xAC8C; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xC5F0;&#xC2B5;"><meta property="og:image" content="https://afrontend.github.io/images/afrontend.png"><meta property="og:url" content="https://afrontend.github.io"><script async src="https://www.googletagmanager.com/gtag/js?id=UA-81660498-2"></script><script>window.dataLayer = window.dataLayer || [];
      function gtag(){dataLayer.push(arguments)};
      gtag('js', new Date());
    
      gtag('config', 'UA-81660498-2');</script><link media="screen" rel="stylesheet" href="/assets/stylesheets/c70d4388df3c9fc6c10a8022fdc7098813d0d1ae.min.css"></head><body><div class="header_bar"><div class="header"><div class="float-left"><a href="/index.html" title="&#xC6F9; &#xC77D;&#xACE0; &#xC4F0;&#xACE0;">Home</a> <a href="/about" title="&#xC800;&#xB294;">About</a></div></div></div><div class="post"><h1>&#xC815;&#xC801; &#xC0AC;&#xC774;&#xD2B8; &#xC0DD;&#xC131;&#xAE30; - Metalsmith<div class="post_date">2017/10/06</div></h1><br><h2 id="static-site-generator">Static Site Generator</h2><p><a href="https://agvim.wordpress.com/">&#xC6CC;&#xB4DC;&#xD504;&#xB808;&#xC2A4;&#xC5D0;&#xC11C; &#xAE00;&#xC744; &#xC4F0;&#xACE0;</a> &#xC788;&#xB294;&#xB370; &#xC870;&#xAE08; &#xB354; &#xAC00;&#xBCBC;&#xC6B4; &#xD234;&#xC744; &#xCC3E;&#xAE30;&#xB85C; &#xD588;&#xB2E4;. <a href="https://agvim.wordpress.com/2017/09/20/wordpress-tip-3/">&#xAC00;&#xC785;&#xD615; &#xC6CC;&#xB4DC;&#xD504;&#xB808;&#xC2A4;&#xB97C; &#xBB34;&#xB8CC;&#xB85C; &#xC0AC;&#xC6A9;</a>&#xD558;&#xBA74; &#xC57D;&#xAC04;&#xC758; &#xBD88;&#xD3B8;&#xD568;&#xC774; &#xC788;&#xB2E4;.</p><ul><li>&#xC81C;&#xD55C;&#xB41C; &#xBB34;&#xB8CC; &#xD14C;&#xB9C8;&#xB9CC; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.</li><li>&#xC18C;&#xC2A4; &#xCF54;&#xB4DC; &#xD45C;&#xD604;&#xC774; &#xC790;&#xC720;&#xB86D;&#xC9C0; &#xBABB;&#xD558;&#xB2E4;.</li><li>&#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB2E4;.</li><li>&#xAD11;&#xACE0;&#xAC00; &#xBD99;&#xB294;&#xB2E4;.</li></ul><p>&#xADF8;&#xB9AC;&#xACE0; &#xC6F9; &#xB370;&#xC774;&#xD130; &#xC77D;&#xAE30;&#xC640; &#xC4F0;&#xAE30;&#xC5D0; &#xAD00;&#xD55C; &#xAE00;&#xB9CC; &#xB530;&#xB85C; &#xBAA8;&#xC73C;&#xB824;&#xB294; &#xBAA9;&#xC801;&#xB3C4; &#xC788;&#xC5C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC6CC;&#xB4DC;&#xD504;&#xB808;&#xC2A4; &#xB300;&#xC2E0; &#xC815;&#xC801; &#xC0AC;&#xC774;&#xD2B8; &#xC0DD;&#xC131;&#xAE30;(<a href="https://davidwalsh.name/introduction-static-site-generators">Static Site Generator</a>)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;&#xB85C; &#xC120;&#xD0DD;&#xD588;&#xB2E4;. &#xC704;&#xB4DC;&#xD504;&#xB808;&#xC2A4;&#xC640; &#xB2E4;&#xB974;&#xAC8C;</p><ul><li>&#xAE00;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC11C;&#xBC84;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</li><li>&#xBE4C;&#xB4DC;&#xC5D0; &#xC758;&#xD574;&#xC11C; &#xC0DD;&#xC131;&#xB41C;&#xB2E4;.</li><li>&#xAD00;&#xB9AC; &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xC5C6;&#xB2E4;.</li><li>&#xC628;&#xB77C;&#xC778;&#xC5D0;&#xC11C; &#xAE00;&#xC744; &#xC4F8; &#xC218; &#xC5C6;&#xB2E4;.</li><li>&#xC11C;&#xBC84;&#xC640; &#xD1B5;&#xC2E0;&#xC774; &#xC5C6;&#xC74C;&#xC73C;&#xB85C; &#xCD5C;&#xC18C;&#xD55C;&#xC758; &#xC6F9; &#xC11C;&#xBC84; &#xAE30;&#xB2A5;&#xB9CC; &#xD544;&#xC694;&#xD558;&#xB2E4;.</li></ul><p>&#xC5B4;&#xB5BB;&#xAC8C; &#xBCF4;&#xBA74; &#xC6CC;&#xB4DC;&#xD504;&#xB808;&#xC2A4;&#xC5D0; &#xBE44;&#xD574; &#xAE30;&#xB2A5;&#xC774; &#xC81C;&#xD55C;&#xB418;&#xB294; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC; &#xAF2D; &#xD544;&#xC694;&#xD55C; &#xAE30;&#xB2A5;&#xB9CC; &#xB0B4;&#xAC00; &#xC870;&#xB9BD;&#xD558;&#xB294; &#xC990;&#xAC70;&#xC6C0;&#xC774; &#xC788;&#xB2E4;. &#xC774; &#xD234;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC0DD;&#xC0B0;&#xB41C; &#xD30C;&#xC77C;&#xC744; &#xD2B9;&#xC815; &#xC6F9; &#xC11C;&#xBC84;&#xC5D0; &#xC62C;&#xB824;&#xC11C; &#xBE14;&#xB85C;&#xADF8; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD560; &#xC218; &#xC788;&#xB2E4;. GitHub Pages&#xB3C4; &#xC774;&#xB7F0; &#xD30C;&#xC77C;&#xC744; &#xC62C;&#xB9B4; &#xC218; &#xC788;&#xB294; &#xC6F9; &#xC11C;&#xBC84;&#xC758; &#xD55C; &#xC608;&#xB2E4;. <strong>S</strong>tatic <strong>S</strong>ite <strong>G</strong>enerator&#xB294; &#xC885;&#xB958;&#xAC00; &#xB9CE;&#xC544;&#xC11C; <a href="https://www.staticgen.com/">&#xACE0;&#xB974;&#xB294; &#xAC8C;</a> &#xC77C;&#xC774;&#xB2E4;. &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xB294; &#xAC83;&#xC744; &#xBCF4;&#xACE0; &#xB180;&#xB790;&#xB2E4;. &#xD3C9;&#xC18C;&#xC5D0; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xADF8;&#xB7F0;&#xC9C0; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xAC83;&#xC744; &#xCC3E;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;. &#xC774;&#xC804;&#xC5D0; <a href="https://agvim.wordpress.com/2017/09/19/hubpress-%EC%84%A4%EC%B9%98%EB%A5%BC-%ED%8F%AC%EA%B8%B0%ED%95%9C-%EC%9D%B4%EC%9C%A0/">HubPress &#xC124;&#xCE58;&#xC5D0; &#xC2E4;&#xD328;</a>&#xD588;&#xACE0; &#xB2E4;&#xC2DC; <a href="https://hexo.io/ko/index.html">Hexo</a>&#xC5D0; &#xB3C4;&#xC804;&#xD588;&#xB2E4;. &#xC6CC;&#xB4DC;&#xD504;&#xB808;&#xC2A4; &#xD14C;&#xB9C8;&#xB97C; &#xBCF4;&#xB294; &#xB290;&#xB08C;&#xC774;&#xC5B4;&#xC11C; &#xCE5C;&#xC219;&#xD588;&#xC9C0;&#xB9CC; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xC758; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBAA8;&#xC2B5;&#xC774; &#xAE08;&#xBC29; &#xB208;&#xC5D0; &#xB4E4;&#xC5B4;&#xC624;&#xC9C0; &#xC54A;&#xC544;&#xC11C; &#xC880; &#xB354; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC26C;&#xC6B4; <a href="http://www.metalsmith.io/">Metalsmith</a>&#xB85C; &#xBCC0;&#xACBD;&#xD588;&#xB2E4;.</p><h2 id="metalsmith">Metalsmith</h2><p><a href="http://www.metalsmith.io/">Metalsmith</a>&#xB294; &#xC815;&#xB9D0;&#xB85C; &#xC791;&#xB2E4;. &#xCC98;&#xC74C; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xB9CC;&#xB0AC;&#xC744; &#xB54C;&#xC758; &#xB290;&#xB08C; &#xB531; &#xADF8;&#xAC83;&#xC774;&#xB2E4; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xCF54;&#xB4DC;&#xAC00; &#xBCF8;&#xB798; &#xC9E7;&#xC740;&#xB370; &#xB354;&#xC6B1;&#xC774; Metalsmith&#xB294; &#xC57D; 400&#xB77C;&#xC778;&#xC774;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC5D0;&#xC11C; &#xCC3E;&#xC73C;&#xB77C;&#xACE0; &#xD55C;&#xB2E4;. &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; <a href="http://expressjs.com/ko/">Express</a>&#xC5D0;&#xC11C; &#xBBF8;&#xB4E4;&#xC6E8;&#xC5B4; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xB2E4;. &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC73C;&#xB85C; &#xC9C0;&#xB098;&#xAC00;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xAC01;&#xAC01;&#xC758; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#xD568;&#xC218;&#xAC00; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xB370; Metalsmith chain&#xC774;&#xB77C;&#xACE0; &#xD55C;&#xB2E4;. &#xC5B4;&#xB5A4; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC801;&#xC6A9;&#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xBA74; &#xB41C;&#xB2E4;. 4&#xAC1C;&#xC758; Node.js &#xBAA8;&#xB4C8;&#xACFC; &#xB2E8;, &#xD558;&#xB098;&#xC758; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD55C;&#xB2E4;. &#xBAA8;&#xB4C8;&#xC740; &#xBBF8;&#xB9AC; &#xC124;&#xCE58;&#xAC00; &#xD544;&#xC694;&#xD558;&#xB2E4;.</p><pre><code>npm install metalsmith metalsmith-layouts metalsmith-permalinks metalsmith-markdown
</code></pre><p>&#xD2B9;&#xBCC4;&#xD55C; &#xBA85;&#xB839;&#xC5B4; &#xC5C6;&#xC774; &#xB178;&#xB4DC;&#xC5D0;&#xC11C; &#xC218;&#xD589;&#xD558;&#xBA74; &#xB41C;&#xB2E4;. <a href="https://github.com/segmentio/metalsmith/blob/master/examples/static-site/index.js">index.js</a> &#xC774;&#xB984;&#xB3C4; &#xC784;&#xC758;&#xB85C; &#xC815;&#xD558;&#xBA74; &#xB41C;&#xB2E4;. Hexo &#xAC19;&#xC740; &#xC0DD;&#xC131;&#xAE30;&#xB294; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xBC1B;&#xC73C;&#xBA74; &#xBC14;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370; &#xBC18;&#xD574; Matalsmith&#xB294; &#xC774;&#xB7F0; &#xD654;&#xBA74;&#xC744; &#xBCF4;&#xB824;&#xBA74; &#xCD94;&#xAC00; &#xC791;&#xC5C5;&#xC774; &#xB354; &#xD544;&#xC694;&#xD558;&#xB2E4;.</p><pre><code>node index.js
</code></pre><h2 id="-">&#xB9C8;&#xBB34;&#xB9AC;</h2><p>&#xAC00;&#xC785;&#xD615; &#xBB34;&#xB8CC; &#xC6CC;&#xB4DC;&#xD504;&#xB808;&#xC2A4; &#xAE30;&#xB2A5;&#xACFC; &#xBE44;&#xAD50;&#xD558;&#xBA74; SSG&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;. &#xB300;&#xC2E0; &#xC27D;&#xAC8C; &#xC218;&#xC815;&#xD558;&#xACE0; &#xADF8; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xB4E4;&#xC5EC;&#xB2E4; &#xBCFC; &#xC218; &#xC788;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; SSG&#xAC00; &#xADF8;&#xB807;&#xB4EF;&#xC774; Metalsmith&#xB3C4; &#xB313;&#xAE00; &#xAE30;&#xB2A5;&#xC774; &#xC5C6;&#xB2E4;. &#xC11C;&#xBC84;&#xC640; &#xD1B5;&#xC2E0;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC774; &#xC5C6;&#xC73C;&#xB2C8; &#xB2F9;&#xC5F0;&#xD558;&#xB2E4;. <a href="https://disqus.com/">Disqus</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB313;&#xAE00; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD588;&#xB2E4;. &#xB2F9;&#xC2E0;&#xC774; &#xBCF4;&#xACE0; &#xC788;&#xB294; &#xC774; &#xBE14;&#xB85C;&#xADF8;&#xAC00; &#xADF8; &#xACB0;&#xACFC;&#xB2E4;.</p><br><div><a href="https://github.com/afrontend" title="GitHub"><img style="width:20px;height:20px" src="https://agvim.files.wordpress.com/2015/08/github-mark-32px.png" alt="github.com/afrontend"></a>&#xA0;<a href="https://github.com/afrontend" title="GitHub">Afrontend</a> <a href="https://agvim.wordpress.com" title="Afrontend Blog"><img style="width:20px;height:20px" src="https://agvim.files.wordpress.com/2017/10/wordpress-logo-32-blue.png" alt="https://agvim.wordpress.com/"></a>&#xA0;<a href="https://agvim.wordpress.com/" title="Afrontend Blog">Afrontend Blog</a> <span style="font-size:25px">@</span> <a href="https://feedburner.google.com/fb/a/mailverify?uri=AfrontendWebData&amp;loc=en_US" title="&#xC774;&#xBA54;&#xC77C;&#xB85C; &#xAE00;&#xC744; &#xBC1B;&#xC544; &#xBCFC; &#xC218; &#xC788;&#xC5B4;&#xC694;" rel="alternate">&#xC774;&#xBA54;&#xC77C; &#xAD6C;&#xB3C5;&#xD558;&#xAE30;</a> <a href="http://feeds.feedburner.com/AfrontendWebData" title="&#xD53C;&#xB4DC; &#xAD6C;&#xB3C5;&#xD558;&#xAE30;" rel="alternate"><img style="width:20px;height:20px" src="https://feedburner.google.com/fb/images/pub/feed-icon32x32.png" alt=""></a>&#xA0;<a href="http://feeds.feedburner.com/AfrontendWebData" title="&#xD53C;&#xB4DC; &#xAD6C;&#xB3C5;&#xD558;&#xAE30;" rel="alternate">RSS</a></div><br><div id="disqus_thread"></div><script>/**
      *  RECOMMENDED CONFIGURATION VARIABLES: EDIT AND UNCOMMENT THE SECTION BELOW TO INSERT DYNAMIC VALUES FROM YOUR PLATFORM OR CMS.
      *  LEARN WHY DEFINING THESE VARIABLES IS IMPORTANT: https://disqus.com/admin/universalcode/#configuration-variables*/
      /*
      var disqus_config = function () {
      this.page.url = PAGE_URL;  // Replace PAGE_URL with your page's canonical URL variable
      this.page.identifier = PAGE_IDENTIFIER; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
      };
      */
      (function() { // DON'T EDIT BELOW THIS LINE
      var d = document, s = d.createElement('script');
      s.src = 'https://afrontend-github-io.disqus.com/embed.js';
      s.setAttribute('data-timestamp', +new Date());
      (d.head || d.body).appendChild(s);
      })();</script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><div class="footer"></div></div><script id="dsq-count-scr" src="//afrontend-github-io.disqus.com/count.js" async></script></body></html>